# AddInCommandBinding Class

---
This object represents a binding between a Revit command and one or more handlers which override the behavior of the command in Revit.
SystemObject Autodesk.Revit.UIAddInCommandBinding
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class AddInCommandBinding

    Public Class AddInCommandBinding

    public ref class AddInCommandBinding

    type AddInCommandBinding = class end
The AddInCommandBinding type exposes the following members.
| Name| Description
---|---|---
| RevitCommandId| The Revit command Id.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| BeforeExecuted| Occurs before the command associated with this AddInCommandBinding executes.
| CanExecute| Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target.
| Executed| Occurs when the command associated with this AddInCommandBinding executes.
Top
#### Reference
Autodesk.Revit.UI Namespace